app/controllers/comments_controller.rb

	def create
		@comment = @message.comments.create(comment_params)
		@comment.user_id = current_user.id

		if @comment.save
---
INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "pojj"], ["message_id", 3], ["created_at", "2016-05-05 04:17:04.898802"], ["updated_at", "2016-05-05 04:17:04.898802"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2016-05-05 04:17:05.053809"], ["id", 1]]