app/controllers/messages_controller.rb

	def create
		@message = current_user.messages.build(message_params)
		if @message.save
---
INSERT INTO "messages" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Voiture"], ["description", "bla bla bla"], ["created_at", "2016-05-02 06:56:09.418867"], ["updated_at", "2016-05-02 06:56:09.418867"]]

	def update
		if @message.update(message_params)
---
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "ta ta ta"], ["updated_at", "2016-05-02 12:01:01.781422"], ["id", 1]]